In [1]:
import pandas as pd
import numpy as np
import mysql.connector
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:root@localhost:3306/DATABASE_EXAMEN', echo=False)
engine_postgres = create_engine('postgresql+psycopg2://root:root@localhost:5432/database_examen', echo=False)

# Carga de File en Tabla de MySQL

In [2]:
data = pd.read_csv("data_prueba_tecnica_.csv")

In [3]:
# Se cargaron los datos a MySQL , solo para tener una variedad en el almacenamiento de los datos
# Se modificaron tambien 3 valores a mano para tener el formato completo en la columna created_at

data.to_sql(name='STAGING_DATA', con=engine, if_exists = 'replace', index=False)

In [4]:
data.head()

,id,name,company_id,amount,status,created_at,paid_at
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,48ba4bdbfb56ceebb32f2bd0263e759be942af3d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.0,voided,2019-03-19,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.0,pending_payment,2019-05-06,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# Extracción de Datos

In [5]:
# Se hizo la extracción de datos desde la base de datos con un select para que fuera mas facil 

df = pd.read_sql(
    "SELECT * FROM STAGING_DATA",
    con=engine)

In [6]:
df.head()

,id,name,company_id,amount,status,created_at,paid_at
0,None,None,None,NaN,None,None,None
1,48ba4bdbfb56ceebb32f2bd0263e759be942af3d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.0,voided,2019-03-19,None
2,None,None,None,NaN,None,None,None
3,05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.0,pending_payment,2019-05-06,None
4,None,None,None,NaN,None,None,None

# Transformación de Datos

In [7]:
# Se hizo el conteo de valores null, para dropear valores importantes , en donde sin ese valor no tiene sentido 
# mantener el registro

df.isnull().sum()

id            10003
name          10003
company_id    10004
amount        10000
status        10000
created_at    10000
paid_at       13991
dtype: int64

In [8]:
# Se hizo el dropeo de valores null de id

df = df.dropna(subset=["id"])

In [9]:
df.isnull().sum()

id               0
name             3
company_id       4
amount           0
status           0
created_at       0
paid_at       3990
dtype: int64

In [10]:
# Se programo lo siguiente para encontrar patrones inusuales en los datos y poderlos corregir

for column in df.columns:
    print("\n")
    print("Columna: "+column)
    print(df[column].value_counts())

Columna: id
380c4162ec5492a55c941b9684323b69bf700a21    1
c0210e8b02246c55349acb51990eb5b2f3e76603    1
c1f4a93b79156f42ba5df566057609cafe40d3de    1
dc0de93d2c6de8d24736631acabb285c1163c8dd    1
a8a3f82f4a4fb2c2edb418ce2739ddbf6ab8cd09    1
                                           ..
e8bc86eb115b58474cb923a8ab35911812ffd91c    1
ef9ec85887418d2ccf220686312cfc4c615665d5    1
a0779f51eb8ab4ab22d7b9f9c34a88cdb9f94d7b    1
f7343b4157023e584eb412d199007fdd8293baaa    1
86c40f4532853b2cfbab99fd198d261a0a7005dc    1
Name: id, Length: 9997, dtype: int64


Columna: name
MiPasajefy        9896
Muebles chidos      96
MiPas0xFFFF          1
MiP0xFFFF            1
Name: name, dtype: int64


Columna: company_id
cbf1c8b09cd5b549416d49d220a40cbd317f952e    9896
8f642dc67fccf861548dfe1c761ce22f795e91f0      96
*******                                        1
Name: company_id, dtype: int64


Columna: amount
3.00      1980
55.75      162
41.61      117
44.60       92
33.45       64
          ...
101.43       1
43.35        1
864.79       1
142.24       1
55.06        1
Name: amount, Length: 5770, dtype: int64


Columna: status
paid                  5890
voided                2084
pending_payment       1880
refunded                93
charged_back            21
pre_authorized          18
expired                  8
partially_refunded       1
p&0x3fid                 1
0xFFFF                   1
Name: status, dtype: int64


Columna: created_at
2019-03-01    117
2019-02-27    104
2019-03-02    104
2019-03-08    103
2019-02-28    103
             ...
2019-04-20     43
2019-01-27     43
2019-04-19     37
2019-02-04     35
2019-05-20      8
Name: created_at, Length: 140, dtype: int64


Columna: paid_at
2019-02-27    71
2019-03-01    67
2019-02-28    67
2019-02-14    64
2019-03-07    63
              ..
2019-02-04    21
2019-04-20    19
2019-05-05    17
2019-01-01    17
2019-05-20     3
Name: paid_at, Length: 140, dtype: int64

In [11]:
df["name"] = df["name"].astype(str)

In [12]:
df.name.value_counts()

MiPasajefy        9896
Muebles chidos      96
None                 3
MiPas0xFFFF          1
MiP0xFFFF            1
Name: name, dtype: int64

In [13]:
# Con el siguiente fragmento de código se limpiaron valores incorrectos de la data

mask = df.name=="MiP0xFFFF"
column_name = 'name'
df.loc[mask, column_name] = np.nan

mask = df.name=="MiPas0xFFFF"
column_name = 'name'
df.loc[mask, column_name] = np.nan

mask = df.company_id=="*******"
column_name = 'company_id'
df.loc[mask, column_name] = np.nan

mask = df.status=="p&0x3fid"
column_name = 'status'
df.loc[mask, column_name] = np.nan

mask = df.status=="0xFFFF"
column_name = 'status'
df.loc[mask, column_name] = np.nan

df["created_at"] = pd.to_datetime(df["created_at"])
df["paid_at"] = pd.to_datetime(df["paid_at"])

In [14]:
for column in df.columns:
    print("\n")
    print("Columna: "+column)
    print(df[column].value_counts())

Columna: id
380c4162ec5492a55c941b9684323b69bf700a21    1
c0210e8b02246c55349acb51990eb5b2f3e76603    1
c1f4a93b79156f42ba5df566057609cafe40d3de    1
dc0de93d2c6de8d24736631acabb285c1163c8dd    1
a8a3f82f4a4fb2c2edb418ce2739ddbf6ab8cd09    1
                                           ..
e8bc86eb115b58474cb923a8ab35911812ffd91c    1
ef9ec85887418d2ccf220686312cfc4c615665d5    1
a0779f51eb8ab4ab22d7b9f9c34a88cdb9f94d7b    1
f7343b4157023e584eb412d199007fdd8293baaa    1
86c40f4532853b2cfbab99fd198d261a0a7005dc    1
Name: id, Length: 9997, dtype: int64


Columna: name
MiPasajefy        9896
Muebles chidos      96
None                 3
Name: name, dtype: int64


Columna: company_id
cbf1c8b09cd5b549416d49d220a40cbd317f952e    9896
8f642dc67fccf861548dfe1c761ce22f795e91f0      96
Name: company_id, dtype: int64


Columna: amount
3.00      1980
55.75      162
41.61      117
44.60       92
33.45       64
          ...
101.43       1
43.35        1
864.79       1
142.24       1
55.06        1
Name: amount, Length: 5770, dtype: int64


Columna: status
paid                  5890
voided                2084
pending_payment       1880
refunded                93
charged_back            21
pre_authorized          18
expired                  8
partially_refunded       1
Name: status, dtype: int64


Columna: created_at
2019-03-01    117
2019-02-27    104
2019-03-02    104
2019-03-08    103
2019-02-28    103
             ...
2019-01-27     43
2019-04-20     43
2019-04-19     37
2019-02-04     35
2019-05-20      8
Name: created_at, Length: 140, dtype: int64


Columna: paid_at
2019-02-27    71
2019-02-28    67
2019-03-01    67
2019-02-14    64
2019-03-07    63
              ..
2019-02-04    21
2019-04-20    19
2019-05-05    17
2019-01-01    17
2019-05-20     3
Name: paid_at, Length: 140, dtype: int64

In [15]:
# Se renombraron las columnas para tenerlas al formato requerido

df=df.rename(columns={"name":"company_name","paid_at":"updated_at"})

# Carga de Datos

In [16]:
df.to_sql(name='FINAL_TABLE', con=engine_postgres, if_exists = 'append', index=False)

# Dispersion de la información

In [17]:
df.head()

,id,company_name,company_id,amount,status,created_at,updated_at
1,48ba4bdbfb56ceebb32f2bd0263e759be942af3d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,voided,2019-03-19,NaT
3,05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,pending_payment,2019-05-06,NaT
5,2cdce231c1fc6a2061bfa2f1d978351fe217245d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.00,voided,2019-02-22,NaT
7,81633ba310a50b673efd469c37139576982901aa,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,102.61,paid,2019-02-27,2019-02-27
9,6ccfc4c24e788e4bca448df343698782db6b0c0b,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,184.49,paid,2019-02-05,2019-02-05

In [18]:
# Se hicieron las tablas divididas para tenerlas en la base de datos
charges = df[['id','company_id', 'amount', 'status', 'created_at','updated_at']]
companies = df[['company_name', 'company_id']]
companies = companies.company_name.replace(to_replace="None", value=np.nan)
companies = df[['company_name', 'company_id']].drop_duplicates(subset=['company_id']).dropna(subset=["company_id"]).reset_index(drop=True)

In [19]:
charges.to_sql(name='charges', con=engine_postgres, if_exists = 'replace', index=False)
companies.to_sql(name='companies', con=engine_postgres, if_exists = 'replace', index=False)